## **Assignment - Week 4**

**Instructions:** 
- Answer each question on a separate cell, either in a markdown or code cell depending on the question.
- Use comments in your code

## **Question 1**
Create a Pandas Series from a list of temperatures: 22, 25, 30, 28, 35, 32, 33 and label the indexes as Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday and specify the data type to be ```float32```.\
Display the series.

#### Load in Pandas and NumPy

In [5]:
import numpy as np
import pandas as pd

In [76]:
# Temperatures info
temperatures = [22, 25, 30, 28, 35, 32, 33]

# Customized index
index = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

# Create a Series
my_series = pd.Series(temperatures, index=index, dtype="float32")

# Display the series
display(my_series)

Monday       22.0
Tuesday      25.0
Wednesday    30.0
Thursday     28.0
Friday       35.0
Saturday     32.0
Sunday       33.0
dtype: float32

## **Question 2**
Construct a Pandas Series with  20 numbers from 100 to 150 and create an index from 1- 20 using the ```np.arange``` function. Specify the data type to be of ```float64```.

In [18]:
# Create an array of 20 numbers from 100 to 150 with float64 data type
data = np.random.randint(100, 151, size=20)

# Create an index from 1 to 20
index = np.arange(1, 21)

# Construct the Pandas Series
series = pd.Series(data, index=index, dtype="float64")

print(series)

1     104.0
2     100.0
3     108.0
4     138.0
5     150.0
6     119.0
7     142.0
8     114.0
9     122.0
10    125.0
11    117.0
12    122.0
13    114.0
14    109.0
15    105.0
16    146.0
17    137.0
18    106.0
19    137.0
20    106.0
dtype: float64

## **Question 3**
Create a pandas DataFrame with 10 rows with the following columns:
- Name (random names with your name being the first)
- State
- Age
- Weight (in kg)
- Gender

Display the DataFrame

In [75]:
# Create a dictionary for the informations
info_dict = {
    "Name" : ["Dauda", "Tayo", "Ayo", "Richard", "Nifemi", "Kingsley", "Benedict", "Dahiru", "Oyin", "Oreofe"],
    "State" : ["Ogun", "Osun", "Ekiti", "Kogi", "Ogun", "Anambra", "Edo", "Kwara", "Oyo", "Ondo"],
    "Age" : [30, 24, 40, 24, 25, 35, 32, 45, 15, 28],
    "Weight (kg)" : [70.5, 68, 61, 75.2, 60, 70.3, 74, 78.1, 52.9, 72.7],
    "Gender" : ["Male", "Male", "Male", "Male", "Female", "Male", "Male", "Male", "Female", "Male"]
}

# Create the DataFrame
df = pd.DataFrame(info_dict)

display(df)

       Name    State  Age  Weight (kg)  Gender
0     Dauda     Ogun   30         70.5    Male
1      Tayo     Osun   24         68.0    Male
2       Ayo    Ekiti   40         61.0    Male
3   Richard     Kogi   24         75.2    Male
4    Nifemi     Ogun   25         60.0  Female
5  Kingsley  Anambra   35         70.3    Male
6  Benedict      Edo   32         74.0    Male
7    Dahiru    Kwara   45         78.1    Male
8      Oyin      Oyo   15         52.9  Female
9    Oreofe     Ondo   28         72.7    Male

## **Question 4**
For the above DataFrame, write code to print its shape, columns, and the data type of each column.

In [74]:
# Print shape
print("Shape of the DataFrame:", df.shape)
print("================================")

# Print columns
print("Columns in the DataFrame:", df.columns)
print("================================")

# Print data types of each column
print("Data types of each column:")
print(df.dtypes)

Shape of the DataFrame: (10, 6)
================================
Columns in the DataFrame: Index(['Name', 'State', 'Age', 'Weight (kg)', 'Gender', 'Occupation'], dtype='object')
================================
Data types of each column:
Name            object
State           object
Age              int64
Weight (kg)    float64
Gender          object
Occupation      object
dtype: object

## **Question 5**

Add a new column `occupation` to the DataFrame you created.

In [70]:
# create and add a new column to df
df['Occupation'] = ["Software Enginner", "Data Annotator", "Educator", "Trader", "Beautician", "Trader", "Engineer", "Hotelier", "Artist", "Digtal Marketer"]
display(df)

       Name    State  Age  Weight (kg)  Gender         Occupation
0     Dauda     Ogun   30         70.5    Male  Software Enginner
1      Tayo     Osun   24         68.0    Male     Data Annotator
2       Ayo    Ekiti   40         61.0    Male           Educator
3   Richard     Kogi   24         75.2    Male             Trader
4    Nifemi     Ogun   25         60.0  Female         Beautician
5  Kingsley  Anambra   35         70.3    Male             Trader
6  Benedict      Edo   32         74.0    Male           Engineer
7    Dahiru    Kwara   45         78.1    Male           Hotelier
8      Oyin      Oyo   15         52.9  Female             Artist
9    Oreofe     Ondo   28         72.7    Male    Digtal Marketer

## **Question 6**

Create two Series, `A` and `B`, containing the numbers 1 - 5 and 6 - 10 respectively. Compute the sum, difference ```(B-A)```, and product of `A` and `B`.

In [69]:
# Create two series A and B
A = pd.Series([1, 2, 3, 4, 5])
B = pd.Series([6, 7, 8, 9, 10])

sum = A + B

# Difference of A and B
difference = A - B

# Product of A and B
product = A * B

# Print the results
print("Sum(A+B):")
print(sum)
print("=====================")
print("Difference(A-B):")
print(difference)
print("=====================")
print("Product(A*B):") 
print(product)

Sum(A+B):
0     7
1     9
2    11
3    13
4    15
dtype: int64
=====================
Difference(A-B):
0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64
=====================
Product(A*B):
0     6
1    14
2    24
3    36
4    50
dtype: int64

## **Question 7**

Lists 10 attributes/methods of a Series (don't include the ones we talked about in class). _You can use the ```dir()``` function to get the attributes/methods_

#### 10 attributes/methods of a Series
1. 'expanding'
2. 'explode'
3. 'factorize'
4. 'first'
5. 'first_valid_index'
6. 'flags'
7. 'floordiv'
8. 'ge'
9. 'groupby'
10. 'gt'

## **Question 8**

Lists 10 attributes/methods of a DataFrame (don't include the ones we talked about in class).

#### 10 attributes/methods of a DataFrame
1. 'to_xml'
2. 'transform'
3. 'transpose'
4. 'truediv'
5. 'truncate'
6. 'tz_convert'
7. 'tz_localize'
8. 'unstack'
9. 'update'
10. '_agg_see_also_doc'

## **Question 9**

Highlight 3 differences between a `Series` and `DataFrame`

#### 3 Differences between a Series and DataFrame

1. A **Series** is a one-dimensional labelled array that can hold data of any type (e.g integers, strings, floats) while a **DataFrame** is a two-dimensional labelled data structure.
2. A **Series** is size immutable while a **DataFrame** is a size-mutable data structure.
3. A **Series** is typically used for representing a single column of data while a **DataFrame** is used for handling tabular data, combining multiple Series into a structured format.

## **Question 10**
List two key points you learnt in week 5 classes

1. I learnt about **Pandas** and the data structures
2. I also learnt how to perform basic operations on **Series** and **DataFrames**.